import IVacation from "./vacation"
import img1 from '../images/img1.png'
import img2 from '../images/img2.png'
import img3 from '../images/img3.png'

const VacationsAll:IVacation[] = [
    {
        isLiked:false,
        isEnter:false,
        image:img1,
        company:"Интернет Люди",
        name:"Front-end Разработчик",
        city:"Москва",
        skils: [
            "JQuery", "JavaScript", "React", "Vue"
        ],
        date: "32.13.2024",
        grafic: "Гибкий график",
        loud: "Полная занятость",
        exp : "Нет опыта",
        workZP : "40 000",
        desc : [
            "Мы, Winfinity, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img2,
        company:"Интернет Люди",
        name:"Front-end Разработчик",
        city:"Минск",
        skils: [
            "JQuery", "JavaScript", "React", "Vue"
        ],
        date: "32.13.2024",
        grafic: "Гибкий график",
        loud: "Полная занятость",
        exp : "Нет опыта",
        workZP : "40 000",
        desc : [
            "Мы, Winfinity, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img2,
        company:"GOOD CALL DEVELOPMENT",
        name:"React Developer (Middle/Senior)",
        city:"Москва",
        skils: [
            "React", "Git", "Vue", "JavaScript", "Flexbox", "HTML5", "SASS", "CSS3"
        ],
        date: "32.13.2024",
        grafic: "Полный день",
        loud: "Частичная занятость",
        exp : "От 1 года до 3 лет",
        workZP : "80 000",
        desc : [
            "Мы, GCD, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img3,
        company:"Winfinity",
        name:"Frontend developer (React)",
        city:"Москва",
        skils: [
            "React", "JavaScript", "Flexbox", "HTML5", "SASS", "CSS3"
        ],
        date: "32.13.2024",
        grafic: "Гибкий график",
        loud: "Частичная занятость",
        exp : "Нет опыта",
        workZP : "40 000",
        desc : [
            "Мы, Winfinity, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img2,
        company:"ITechArt",
        name:"Frontend developer (React)",
        city:"Москва",
        skils: [
            "React", "JavaScript", "CSS3"
        ],
        date: "32.13.2024",
        grafic: "Удаленная работа",
        loud: "Проектная работа",
        exp : "От 3 до 6 лет",
        workZP : "100 000",
        desc : [
            "Мы, ITechArt, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img1,
        company:"Winfinity",
        name:"Frontend Developer (Vue.js)",
        city:"Пинск",
        skils: [
            "Vue", "JavaScript", "HTML5", "SASS", "CSS3"
        ],
        date: "32.13.2024",
        grafic: "Гибкий график",
        loud: "Стажировка",
        exp : "Более 6 лет",
        workZP : "150 000",
        desc : [
            "Мы, Winfinity, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img1,
        company:"GOOD CALL DEVELOPMENT",
        name:"React Developer (Middle/Senior)",
        city:"Минск",
        skils: [
            "React", "Git", "Vue", "JavaScript", "Flexbox", "HTML5", "SASS", "CSS3"
        ],
        date: "32.13.2024",
        grafic: "Полный день",
        loud: "Частичная занятость",
        exp : "От 1 года до 3 лет",
        workZP : "80 000",
        desc : [
            "Мы, GCD, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img2,
        company:"GOOD CALL DEVELOPMENT",
        name:"React Developer (Middle/Senior)",
        city:"Гродно",
        skils: [
            "React", "Git", "Vue", "JavaScript", "Flexbox", "HTML5", "SASS", "CSS3"
        ],
        date: "32.13.2024",
        grafic: "Полный день",
        loud: "Частичная занятость",
        exp : "От 1 года до 3 лет",
        workZP : "80 000",
        desc : [
            "Мы, GCD, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    },
    {
        isLiked:false,
        isEnter:false,
        image:img2,
        company:"ITechArt",
        name:"Frontend developer (React)",
        city:"Гродно",
        skils: [
            "React", "JavaScript", "CSS3"
        ],
        date: "32.13.2024",
        grafic: "Удаленная работа",
        loud: "Проектная работа",
        exp : "От 3 до 6 лет",
        workZP : "100 000",
        desc : [
            "Мы, ITechArt, занимаемся разработкой инновационных решений в области игорно-развлекательного контента.",
            "Для создания наших продуктов используются передовые технологии, среди ко-торых: Computer Vision, Unreal Engine, Ultra Low Latency Video Streaming. У нас очень крутой и суперсовременный технопарк - от камер и света, до графиче-ских карт, которые почти невозможно найти.",
            "Сегодня мы на стадии активного развития. Мы создаём масштабный, техноло-гически сложный и в тоже время очень интересный, глобальный проект - ча-стью которого можете стать Вы!"
        ],
        expIn: [
            "опыт коммерческой разработки на JavaScript от 2 лет;",
            "опыт коммерческой разработки на React от 2 лет;",
            "опыт работы в команде с git;"
        ]
    }
]

export default VacationsAll;